{
  "home": {
    "name": "Edain Jesus Cortez Ceron",
    "description": "Ingeniero de Software & Desarrollador full stack",
    "avatar": {
      "src": "https://avatars.githubusercontent.com/u/101297627?v=4",
      "alt": "Avatar de Edain Jesus Cortez Ceron"
    },
    "enlaces": {
      "github": "https://github.com/Astralzz",
      "linkedin": "https://linkedin.com/in/edain-jesus-cortez-ceron-23b26b155",
      "email": "mailto:edain.cortez@outlook.com",
      "facebook": "https://www.facebook.com/lAstralz",
      "telegram": "https://t.me/lAstralz"
    }
  },
  "introduction": {
    "paragraph": "<p>Hola, soy <b>Edain Jesús Cortez Cerón</b>, ingeniero de software y desarrollador full stack con más de cinco años de experiencia. Me especializo en la creación de aplicaciones web y móviles, así como en servidores backend escalables, usando tecnologías como <b>React, Spring, React Native, Vue.js, Laravel</b> y <b>Django</b>, entre otras. Mi formación en la <b>Universidad Autónoma de Guerrero</b> y mi experiencia en proyectos para instituciones públicas y privadas me han permitido abordar soluciones desde la arquitectura hasta la experiencia del usuario.<br/>Uno de mis logros destacados es <b>UAGro App</b>, una plataforma móvil con más de 10,000 usuarios activos, desarrollada en React Native y Laravel.<br/>Actualmente, me desempeño como freelancer mientras perfecciono mi inglés para participar en proyectos internacionales. Mi objetivo es crear soluciones funcionales y de impacto.<br/><br/><b>¡Contáctame para que exploremos cómo puedo contribuir a tu próximo proyecto!</b></p>"
  },
  "skills": {
    "title": "Habilidades",
    "languages": {
      "title": "Lenguajes",
      "list": [
        { "name": "JavaScript", "level": 10, "color": "#F7DF1E" },
        { "name": "TypeScript", "level": 10, "color": "#007ACC" },
        { "name": "PHP", "level": 9, "color": "#8993BE" },
        { "name": "Java", "level": 8, "color": "#007396" },
        { "name": "Python", "level": 7, "color": "#306998" },
        { "name": "Dart", "level": 5, "color": "#5E3253FFFF" }
      ]
    },
    "frameworks": {
      "title": "frameworks",
      "list": [
        { "name": "React", "level": 10, "color": "#61DAFB" },
        { "name": "Vue", "level": 5, "color": "#42b883" },
        { "name": "Laravel", "level": 10, "color": "#FF2D55" },
        { "name": "Django", "level": 4, "color": "#092E20" },
        { "name": "Spring Boot", "level": 6, "color": "#6DB33F" },
        { "name": "React Native", "level": 10, "color": "#61DAFB" },
        { "name": "Flutter", "level": 7, "color": "#70919BFF" },
        { "name": "Ionic", "level": 8, "color": "#3880FF" }
      ]
    },
    "databases": {
      "title": "Bases de datos",
      "list": [
        { "name": "MySQL", "level": 10, "color": "#4479A1" },
        { "name": "Oracle", "level": 6, "color": "#F80000" }
      ]
    },
    "tools": {
      "title": "Herramientas",
      "list": [
        { "name": "Git", "level": 9, "color": "#F05033" },
        { "name": "Bootstrap", "level": 9, "color": "#7952B3" },
        { "name": "Tailwind CSS", "level": 10, "color": "#06B6D4" },
        { "name": "Markdown", "level": 10, "color": "#000000" },
        { "name": "Docker", "level": 8, "color": "#2496ED" }
      ]
    },
    "otherSkills": {
      "title": "",
      "list": [
        { "name": "Desarrollo frontend", "level": 9, "color": "#F7DF1E" },
        { "name": "Desarrollo backend", "level": 9, "color": "#007ACC" },
        { "name": "Desarrollo Móvil", "level": 8, "color": "#61DAFB" }
      ]
    }
  },
  "achievements": {
    "title": "Logros destacados",
    "list": [
      {
        "title": "UAGro App",
        "subtitle": "Aplicación oficial de la Universidad Autónoma de Guerrero",
        "tipo": "app",
        "technologies": [
          "Typescript",
          "PHP",
          "React native",
          "Laravel",
          "Oracle"
        ],
        "description": "Aplicación oficial diseñada para facilitar el acceso a información relevante de la Universidad Autónoma de Guerrero. Con un enfoque en la usabilidad, permite a los usuarios consultar calificaciones, explorar la oferta educativa y acceder a programas y departamentos oficiales. Incluye el menú actualizado del comedor universitario, las últimas noticias y eventos, y gestión de actividades académicas desde cualquier lugar a través de un inicio de sesión seguro. Desarrollada en TypeScript y React Native para el frontend, y un backend robusto en Laravel con base de datos Oracle, UAGro App ofrece una experiencia intuitiva y eficiente para la comunidad universitaria.",
        "links": [
          {
            "text": "Página oficial",
            "url": "https://uagroapp.uagro.mx"
          },
          {
            "text": "Play store",
            "url": "https://play.google.com/store/apps/details?id=com.astralz.uagroapp"
          },
          {
            "text": "IOS store",
            "url": "https://apps.apple.com/us/app/uagro-app/id6475783654"
          }
        ]
      },
      {
        "title": "ANUIES",
        "subtitle": "Sistema de prospección para la ampliación de la oferta de educación superior",
        "tipo": "web",
        "technologies": [
          "Typescript",
          "PHP",
          "React",
          "Laravel",
          "MySQL",
          "Tailwind CSS",
          "Recharts"
        ],
        "description": "Página web gubernamental desarrollada para la Asociación Nacional de Universidades e Instituciones de Educación Superior (ANUIES). El sistema cuenta con tres módulos que ayudan a las Comisiones Estatales para la Planificación de la Educación Superior (COEPES) a analizar la oferta educativa local en educación media superior y superior. Facilita la prospección del crecimiento de la matrícula en educación superior a través de un algoritmo diseñado por ANUIES, y permite definir metas y estrategias para cada entidad federativa, así como compartir buenas prácticas entre los estados.",
        "links": [
          {
            "text": "Página oficial",
            "url": "https://ampliacioncobertura.anuies.mx/inicio"
          }
        ]
      },
      {
        "title": "Informe UAGro",
        "subtitle": "Plataforma web y móvil para gestionar el evento del informe 2024 de la UAGro",
        "tipo": "web",
        "technologies": [
          "Typescript",
          "PHP",
          "React",
          "React native",
          "Laravel",
          "MySQL",
          "Tailwind CSS",
          "Dompdf",
          "React-QR"
        ],
        "description": "Informe UAGro es una aplicación móvil y plataforma web diseñada para el evento del informe de la Universidad Autónoma de Guerrero. Desarrollada con React, React Native y Laravel, ofrece un entorno seguro, encriptado y reutilizable para la gestión de invitaciones a través de tokens únicos, así como el envío de correos electrónicos personalizados. Utiliza MySQL como base de datos y Tailwind CSS para un diseño responsivo. Además, incorpora DomPDF para la generación de invitaciones únicas y personalizadas en PDF y React-QR para la creación de códigos QR, facilitando así el acceso a información relevante durante el evento.",
        "links": [
          {
            "text": "Página oficial",
            "url": "https://informerector.uagro.mx"
          }
        ]
      }
    ]
  },
  "experience": {
    "title": "Experiencia Laboral",
    "list": [
      {
        "company": {
          "abbreviations": "SISDAI",
          "name": "Sistema de Diseño y Accesibilidad para la Investigación"
        },
        "role": "Desarrollador Front end",
        "duration": "Diciembre 2023 - Actualidad",
        "description": "En colaboración con el Consejo Nacional de Humanidades, Ciencias y Tecnologías (<b>Conahcyt</b>) y la Facultad de Ciencias Químico Biológicas de la Universidad Autónoma de Guerrero (<b>UAGro</b>), desarrollo páginas web accesibles para el Sistema de Diseño y Accesibilidad para la Investigación (<b>SISDAI</b>), utilizando tecnologías como Vue.js y JavaScript. Además, actúo como intermediario entre ambas instituciones, facilitando la comunicación y coordinación de los equipos a través de Slack. Este proyecto a tiempo parcial me ha permitido combinar tanto habilidades técnicas como de gestión, contribuyendo significativamente al éxito del sistema y mejorando la accesibilidad para investigadores y científicos."
      },
      {
        "company": {
          "abbreviations": "DGTID",
          "name": "Dirección General de tecnologías de la innovación y digitalización"
        },
        "role": "Desarrollador Full Stack",
        "duration": "Enero 2023 - Enero 2025",
        "description": "He participado activamente en diversos proyectos de desarrollo tecnológico, incluyendo la creación de sitios web, aplicaciones móviles, servidores y bases de datos. Con un enfoque multidisciplinario, he trabajado con tecnologías como <b>React, Laravel, React Native, MySQL, Oracle</b>, entre otras. Mi experiencia abarca desde el diseño y administración de bases de datos hasta el desarrollo de servidores y backend, áreas en las que me especializo. Entre los proyectos más relevantes en los que he colaborado destacan <b>UAGro App</b> y el <b>Sistema de Prospección para la Ampliación de la Oferta Educativa Superior</b>, plataformas clave que han impulsado la transformación digital de la universidad, optimizando sus servicios y facilitando el acceso a la tecnología para la comunidad universitaria."
      },
      {
        "company": {
          "abbreviations": "UAGRO",
          "name": "Universidad Autónoma de Guerrero"
        },
        "role": "Maestro del lenguaje java",
        "duration": "Febrero 2002 - Enero 2023",
        "description": "Durante mi último año como estudiante en la Universidad Autónoma de Guerrero (UAGro), formé parte de un programa de apoyo académico donde impartí clases de Java a otros estudiantes de nivel superior. A través de este programa, fui seleccionado para ayudar a mis compañeros a fortalecer sus habilidades en programación, específicamente en Java y conceptos de desarrollo de software. Mi rol incluía la explicación de estructuras de datos y principios de programación orientada a objetos, utilizando proyectos prácticos para mejorar el aprendizaje. Esta experiencia no solo me permitió afianzar mis propios conocimientos, sino también desarrollar habilidades en la enseñanza y en la colaboración con otros estudiantes."
      }
    ]
  },
  "education": {
    "title": "Educación y certificados",
    "list": [
      {
        "institution": "Universidad Autónoma del estado de Guerrero",
        "degree": "Licenciatura en Ingeniería de Software",
        "duration": "2019 - 2023"
      }
    ]
  },
  "references": {
    "title": "Referencias y testimonios",
    "list": [
      {
        "name": "M.A. David León Quiroz",
        "role": "Jefe del Departamento de Sistemas de Información y Transformación Digital",
        "testimonial": "Edain ha demostrado un nivel excepcional de habilidad técnica y compromiso en cada proyecto.",
        "links": {
          "tel": "+527471104674",
          "email": "dleon@uagro.mx"
        }
      },
      {
        "name": "Dr. Valentin Acosta Vello",
        "role": "Subdirector de la facultad de ingeniería de la Universidad Autónoma de Guerrero",
        "testimonial": "Edain es un desarrollador increíblemente talentoso. Su capacidad para abordar problemas complejos y proponer soluciones eficientes es notable.",
        "links": {
          "tel": "+527471622688",
          "email": "valentinastavastav@uagro.mx"
        }
      },
      {
        "name": "Dr. Alfredo Méndez Bahena",
        "role": "Profesor investigador de la Universidad Autónoma de Guerrero y Responsable Técnico del PRONAII 318971",
        "testimonial": "Edain ha sido un excelente colaborador durante la implementación en las paginas web para el Conahcyt (Consejo Nacional de Humanidades, Ciencias y Tecnologías), A demostrador ser muy profecional y aplicado",
        "links": {
          "tel": "+527474590701",
          "email": "amendezbahena@gmail.com"
        }
      }
    ]
  },
  "repositories": {
    "title": "Mis repositorios públicos",
    "description": "Lista de todos los repositorios públicos directamente desde mi cuenta en gitHub"
  }
}
